{
  "base_model_name_or_path": "model",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "lora_alpha": 32,
  "lora_dropout": 0.1,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 32,
  "target_modules": [
    "query_key_value",
    "dense",
    "dense_h_to_4h",
    "dense_4h_to_h"
  ],
  "task_type": "CAUSAL_LM"
}